"""
Написать функцию dict_from_args, которая принимает неограниченное
количество позиционных аргументов и неограниченное количество аргументов
ключевых-слов.

Если все позиционные аргументы - целые числа, то рассчитать их сумму. Если
нет, то кинуть ошибку TypeError("Все позиционные аргументы должны быть целыми").
Проверить, что все аргументы целые можно с помощью функции all:
https://pyneng.readthedocs.io/ru/latest/book/10_useful_functions/all_any.html

Если все аргументы - ключевые слова являются строками, то найти максимальную
длину слова. Если нет, то кинуть ошибку TypeError("Все аргументы - ключевые
слова должны быть строками").

Функция должна вернуть словарь, вида:
{
    "args_sum": 13,
    "kwargs_max_len": 7
}
"""
def dict_from_args(*args, **kwargs):
    result = dict()
    try:
        args_sum = sum(i for i in args)
        result['args_sum'] = args_sum
    except TypeError:
        print('Все позиционные аргументы должны быть целыми числами')
    try:
        kwargs_max_len = max(len(i) for i in kwargs.values())
        result['kwargs_max_len'] = kwargs_max_len
    except TypeError:
        print('Все ключевые аргументы должны быть строками')
    return result

print(dict_from_args(1, 2, 123, 124, c = 'gdfgfdgfgdfg5665', a = 'asdad6', b = 'dfdsfsdfsdf'))